<details ><summary>plan for production 2025-11-01 22:40:43 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudflare_dns_record.bsky_record will be created
  + resource "cloudflare_dns_record" "bsky_record" {
      + content          = "did=did:plc:r74f3l5bzuodnjekrf364t2v"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_atproto"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.dmarc will be created
  + resource "cloudflare_dns_record" "dmarc" {
      + content          = "v=DMARC1; p=quarantine; rua=mailto:me@mirror-kt.dev; ruf=mailto:me@mirror-kt.dev"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_dmarc"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.dub_sh will be created
  + resource "cloudflare_dns_record" "dub_sh" {
      + content          = "cname.dub.sh"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "s"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.github_pages_challenge will be created
  + resource "cloudflare_dns_record" "github_pages_challenge" {
      + content          = "5ccd0ccb2e561700cb4bc02bfb98f1"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_github-pages-challenge-mirror-kt"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.google_workspace will be created
  + resource "cloudflare_dns_record" "google_workspace" {
      + content          = "google-site-verification=HOfSNNDUwvlVJsp2TP7dwJCBub6fX7-Kpw1VGXZ2Ogg"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.keybase will be created
  + resource "cloudflare_dns_record" "keybase" {
      + content          = "keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_keybase"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.mail will be created
  + resource "cloudflare_dns_record" "mail" {
      + content          = "smtp.google.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + priority         = 1
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "MX"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.maven_central will be created
  + resource "cloudflare_dns_record" "maven_central" {
      + content          = "kpzuvwto4j"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.root will be created
  + resource "cloudflare_dns_record" "root" {
      + content          = "mirror-kt.pages.dev"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.spf will be created
  + resource "cloudflare_dns_record" "spf" {
      + content          = "v=spf1 include:_spf.google.com ~all"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (production)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                    RESOURCE                    |
|--------|------------------------------------------------|
| add    | `cloudflare_dns_record.bsky_record`            |
|        | `cloudflare_dns_record.dmarc`                  |
|        | `cloudflare_dns_record.dub_sh`                 |
|        | `cloudflare_dns_record.github_pages_challenge` |
|        | `cloudflare_dns_record.google_workspace`       |
|        | `cloudflare_dns_record.keybase`                |
|        | `cloudflare_dns_record.mail`                   |
|        | `cloudflare_dns_record.maven_central`          |
|        | `cloudflare_dns_record.root`                   |
|        | `cloudflare_dns_record.spf`                    |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p production
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>